# FillPattern Constructor (FillPattern) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillPattern Constructor (FillPattern)
FillPattern Class See Also
---
Constructs a new copy of the input FillPattern object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FillPattern(
	FillPattern other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As FillPattern _
)
```

Visual C++
---
```text
public:
FillPattern(
	FillPattern^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..FillPattern
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FillPattern Class
FillPattern Overload
Autodesk.Revit.DB Namespace